InformationRegisters/ТоварыНацКаталогаИСМПТК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ТоварыНацКаталогаИСМПТК</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусКарточки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКарточекНацКаталогаИСМПТК</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПубликации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КарточкаЗаполнена</Name>
					<Comment>Служебный признак</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатурыИСМПТК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЕдиницаИзмеренияИСМПТК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговаяМарка</Name>
					<Comment>brand_name</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияИСМПТК</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GTIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИИН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>EAN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НоменклатураИСМПТК</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПродукцииИСМПТК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидУпаковки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУпаковокИСМПТК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТНВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыКарточекНацКаталогаИСМПТК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СтатусыКарточекНацКаталогаИСМПТК</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
					<Comment>draf</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаМодерации</Name>
					<Comment>moderation</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетИзменений</Name>
					<Comment>errors</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетПодписания</Name>
					<Comment>notsigned</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опубликована</Name>
					<Comment>published</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ТоварыНацКаталогаИСМПТК/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	//Временная заглушка
	ТекстИсключения = НСтр("ru='Форма объекта не предназначена для непосредственного открытия.'");
	ВызватьИсключение ТекстИсключения;

	Если Параметры.Свойство("Заголовок") Тогда
		ЭтаФорма.Заголовок = Параметры.Заголовок;
		Если Не СтрНайти(Параметры.Заголовок, "требующие уточнения") = 0 
			И Не Параметры.ЭтоВыборКарточки Тогда
			ИнтерфейсИСМПТККлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаРегистрСведенийТоварыНацКаталогаИСМПТКПолучить", "Видимость", Ложь);
		Иначе
			ИнтерфейсИСМПТККлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаРегистрСведенийТоварыНацКаталогаИСМПТКПолучить", "Видимость", Не Параметры.ЭтоВыборКарточки);
		КонецЕсли;
	КонецЕсли;	
	
	Если Параметры.Отбор.Свойство("Организация") Тогда
		ОрганизацияОтбор = Параметры.Отбор.Организация;
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("ВидПродукции") Тогда
		ВидПродукцииОтбор = Параметры.Отбор.ВидПродукции;
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("СтатусКарточки") Тогда
		СтатусКарточкиОтбор = Параметры.Отбор.СтатусКарточки;
	КонецЕсли;
	
	ЭтоВыборКарточки = Параметры.ЭтоВыборКарточки;
	
	УстановитьУсловноеОформление(ЭтоВыборКарточки);
	
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	ВыполнитьВыборТоваров();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ЭтоВыборКарточки Тогда
		ВыполнитьВыборТоваров();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВидПродукцииОтборПриИзменении(Элемент)	
	
	УстановитьБыстрыйОтбор("ВидПродукции", ВидПродукцииОтбор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОтборПриИзменении(Элемент)	
	
	УстановитьБыстрыйОтбор("Организация", ОрганизацияОтбор);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусКарточкиОтборПриИзменении(Элемент)	
	
	УстановитьБыстрыйОтбор("СтатусКарточки", СтатусКарточкиОтбор);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	//Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если Не Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Если Не ЭтоВыборКарточки Тогда
			ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
			Если ТекущаяСтрока.СтатусКарточки = ПредопределенноеЗначение("Перечисление.СтатусыКарточекНацКаталогаИСМПТК.ОжидаетПодписания") Тогда
				ИнтерфейсИСМПТККлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаРегистрСведенийТоварыНацКаталогаИСМПТКОпубликовать", "Видимость", Истина);
			Иначе
				ИнтерфейсИСМПТККлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаРегистрСведенийТоварыНацКаталогаИСМПТКОпубликовать", "Видимость", Ложь);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление(ЭтоВыборКарточки = Ложь)
	
	ИнтерфейсИСМПТККлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаРегистрСведенийТоварыНацКаталогаИСМПТКОбновить", "Видимость", НЕ ЭтоВыборКарточки);
	ИнтерфейсИСМПТККлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаРегистрСведенийТоварыНацКаталогаИСМПТКОпубликовать", "Видимость", НЕ ЭтоВыборКарточки);
	ИнтерфейсИСМПТККлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаВыбрать", "Видимость", ЭтоВыборКарточки);
	ИнтерфейсИСМПТККлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаОтмена",  "Видимость", ЭтоВыборКарточки);
	
	//ИнтерфейсИСМПТККлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтатусКарточкиОтбор", "ТолькоПросмотр", ЭтоВыборКарточки);

	ХарактеристикиИспользуются = ИнтеграцияИСМПТКПереопределяемый.ПроверитьИспользованиеХарактеристик();
	Если ХарактеристикиИспользуются Тогда
		ИнтерфейсИСМПТККлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Характеристика",   "Видимость", ЭтоВыборКарточки);
	Иначе
		ИнтерфейсИСМПТККлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Характеристика",   "Видимость", Ложь);
	КонецЕсли;
	
	ИнтерфейсИСМПТККлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЕдиницаИзмерения", "Видимость", ЭтоВыборКарточки);
	ИнтерфейсИСМПТККлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтатусКарточки",   "Видимость", НЕ ЭтоВыборКарточки);
	ИнтерфейсИСМПТККлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДатаРегистрации",  "Видимость", НЕ ЭтоВыборКарточки);
	ИнтерфейсИСМПТККлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДатаПубликации",   "Видимость", НЕ ЭтоВыборКарточки);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьБыстрыйОтбор(ВидЭлемента, ЗначениеЭлемента)
	
	ИнтеграцияИСМПТККлиентСерверПереопределяемый.ИзменитьЭлементОтбораСписка(Список, ВидЭлемента, ЗначениеЭлемента, ЗначениеЗаполнено(ЗначениеЭлемента));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВыборТоваров()
	
	ВыбранныеТовары = Элементы.Список.ВыделенныеСтроки;
	МассивТоваров = Новый Массив();
	
	Если Не ВыбранныеТовары.Количество() = 0 Тогда
		Для Каждого Строка Из ВыбранныеТовары Цикл
			
			ДанныеТовара = ОбработкаВыбраннойСтроки(Строка);
			МассивТоваров.Добавить(ДанныеТовара);
			
		КонецЦикла;
	КонецЕсли;
	
	ЭтаФорма.Закрыть(МассивТоваров);

КонецПроцедуры

&НаСервере
Функция ОбработкаВыбраннойСтроки(Строка)
	
	ЗаписьКарточка = РегистрыСведений.ТоварыНацКаталогаИСМПТК.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(ЗаписьКарточка, Строка);
	ЗаписьКарточка.Прочитать();
	
	ДанныеТовара = Новый Структура();
	ДанныеТовара.Вставить("Номенклатура", 	ЗаписьКарточка.Номенклатура);
	ДанныеТовара.Вставить("Характеристика", ЗаписьКарточка.Характеристика);
	ДанныеТовара.Вставить("Упаковка", 		ЗаписьКарточка.ЕдиницаИзмерения);
	ДанныеТовара.Вставить("GTIN", 			ЗаписьКарточка.GTIN);
	ДанныеТовара.Вставить("ВидПродукции", 	ЗаписьКарточка.ВидПродукции);
	
	Возврат ДанныеТовара;
	
КонецФункции

#КонецОбласти
